# --- CLI tools ---
brew "bat"                      # cat clone with syntax highlighting
brew "btop"                     # modern system resource monitor
brew "eza"                      # improved ls with icons and colors
brew "fd"                       # fast and user-friendly find
brew "fish"                     # friendly interactive shell
brew "fnm"                      # fast Node.js version manager
brew "fzf"                      # fuzzy finder for the terminal
brew "gemini-cli"               # Google Gemini AI CLI
brew "lolcat"                   # rainbow coloring for terminal output
brew "micro"                    # lightweight terminal text editor
brew "pyenv"                    # manage multiple Python versions
brew "starship"                 # fast and customizable prompt
brew "zoxide"                   # smarter cd command with jump history

# --- Casks ---
cask "docker-desktop"           # container engine and UI
cask "finicky"                  # control which browser/profile opens links
cask "font-fira-code-nerd-font" # developer font with Nerd Font icons
cask "hammerspoon"              # macOS automation tool with Lua scripting
cask "iterm2"                   # terminal emulator for macOS
