# --- Taps ---
tap "domt4/autoupdate"          # keep Homebrew itself and formulae up to date
tap "hamed-elfayome/claude-usage" # Claude API usage tracking
tap "hashicorp/tap"             # HashiCorp tools (provides 'terraform')
tap "sst/tap"                   # custom tap (provides 'opencode' CLI)

# --- CLI tools ---
brew "awscli"                   # AWS command-line interface
brew "bat"                      # cat clone with syntax highlighting
brew "btop"                     # system resource monitor
brew "eza"                      # improved ls with icons and colors
brew "fd"                       # fast and user-friendly find
brew "fish"                     # friendly interactive shell
brew "fnm"                      # fast Node.js version manager
brew "fzf"                      # fuzzy finder for the terminal
brew "gh"                       # GitHub CLI tool
brew "jq"                       # JSON processor
brew "lolcat"                   # rainbow coloring for terminal output
brew "micro"                    # lightweight terminal text editor
brew "node"                     # JavaScript runtime
brew "pyenv"                    # manage multiple Python versions
brew "sst/tap/opencode"         # lightweight open-source Claude-compatible CLI
brew "starship"                 # fast and customizable prompt
brew "terraform"                # infrastructure as code tool
brew "zoxide"                   # smarter cd command with jump history

# --- Casks ---
cask "claude-usage-tracker"     # Claude API usage dashboard
cask "codex"                    # agentic coding CLI
cask "finicky"                  # control which browser/profile opens links
cask "font-fira-code-nerd-font" # developer font with Nerd Font icons
cask "iina"                     # video player
cask "iterm2"                   # terminal emulator
cask "thaw"                     # menu bar manager
